import matplotlib.pyplot as plt

# Дані про час, який проводить продавець з клієнтами
час_з_клієнтами = 15
інший_час = 100 - час_з_клієнтами

# Назви сегментів
назви = ['Час з клієнтами', 'Інший час']

# Дані для кругової діаграми
дані = [час_з_клієнтами, інший_час]

# Створення кругової діаграми
plt.figure(figsize=(8, 8))
plt.pie(дані, labels=назви, autopct='%1.1f%%', startangle=140)

# Відображення заголовка
plt.title('Час, проведений в магазині')

# Відображення кругової діаграми
plt.savefig('d5.png')
plt.show()


